Autodesk.Revit.DB.ForgeDM.CloudHub.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ForgeDM.CloudHub.Name
Name for CloudHub
Since:
2019

Autodesk.Revit.DB.ForgeDM.CloudHub.Id
Identifier for CloudHub
Since:
2019

Autodesk.Revit.DB.ForgeDM.CloudHub.#ctor(System.String,System.String)
Default constructor for CloudHub.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2019

Autodesk.Revit.DB.ForgeDM.CloudHub.#ctor(Autodesk.Revit.DB.ForgeDM.CloudHub)
For communication between Revit and Collaborate add-in.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2019

Autodesk.Revit.DB.ForgeDM.CloudHub
Hub from ForgeDM
Usable by both Revit and Collaborate add-in.
Represents Identifier of current Hub.
Represents Name of current Hub.
Since:
2019